package com.liu.study.arithmetic.interview;

/**
 * 链表面试题。
 *      1、获取单链表的节点的个数（如果带头节点的链表，需要不统计头节点。）
 *      2、查询单链表中的倒数第K个节点。
 *      3、单链表的翻转。
 *      4、从头到尾打印单链表。        -->     使用栈。
 *      5、合并两个有序的单链表，合并之后的链表依然有序。   TODO：
 *
 *
 * @author lwa
 * @version 1.0.0
 * @createTime 2021/3/7 17:40
 */
public class SingleLinkedListInterview {

    public static void main(String[] args) {

    }

    /**
     * 单链表反转。
     *
     * --------         --------            ----------            --------
     * | head |  -->    | first |    -->    | second |     -->   | three |
     * --------         --------            ----------            --------
     *
     * 第一步：创建一个新的头节点，
     * -----------
     * | newHead |
     * -----------
     *
     * 第二步：把第一个节点取下来，并放在newHead后面。
     * ----------           ---------           ----------           ---------
     * | newHead |  -->     | first |    -->    | second |     -->   | three |
     * ----------           ---------           ----------          ---------
     *
     * 第三步：把第二个节点取下来，并放在newHead后面、first前面
     * ----------           ---------           ----------
     * | newHead |  -->     | second |    -->   | first  |
     * ----------           ---------           ----------
     *
     *
     * 最后步：把head节点的next指向新链表的第一个
     * ----------        ---------          ---------           ----------
     * | newHead |  -->  | three |   -->   | second |    -->    | first  |
     * ----------        ---------          ---------           ----------
     *                       ↑
     *                       |
     *                   -----------
     *                   | newHead |
     *                   -----------
     *
     */

}